# 常用的 DataFrame 操作
* merge / transform
* subset
* groupby

# [教學目標]
- 開始的第一堂課 : 我們先一些機器學習的基礎開始, 需要用到一些 Python 語法  
- 如果不熟 Python, 但是至少熟悉過一門語言, 可以從這些範例開始熟悉
- 所謂評價函數 (Metric), 就是機器學習的計分方式, 範例會展示平均絕對誤差 (MAE) 的寫法
- 我們來了解意義並寫作一個函數吧!!

# [範例重點]
- DataFrame 的黏合(concat) (In[3]~In[5], Out[3]~Out[5])
- 使用條件篩選出 DataFrame 的子集合(Subset) (In[9], Out[9], In[10], Out[10])
- DataFrame 的群聚(groupby) 的各種應用方式 (In[11]~In[15], Out[11]~Out[15])

In [182]:
# Import 需要的套件
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

#### Syntax-Create DataFrame

In [183]:
df1=pd.DataFrame(
        {"a" : [4,5,6],
         "b" : [7,8,9],
         "c" : [10,11,12]
        },
    index = [1,2,3]
)

In [184]:
df2 = pd.DataFrame(
        [[4,5,6],
         [7,8,9],
         [10,11,12]],
    index = [1,2,3],
    columns=['a','b','c']
)
df

    Ages  weight
0     20      80
1     22      72
2     25      75
3     27      77
4     21      71
5     23      73
6     37      77
7     31      81
8     61      81
9     45      85
10    41      81
11    20      72
12   101      77

#### Syntax-Create Multi_index DataFrame

In [185]:
pd.DataFrame(
           {"a" : [4 ,5, 6],
            "b" : [7, 8, 9],
            "c" : [10, 11, 12]},
            index = pd.MultiIndex.from_tuples
                ([('d',1),('d',2),('e',2)],names=['n','v']))

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## 重塑DataFrame幾何

#### pd.melt(df) : 把Column導向Row

In [186]:
dfmelt = pd.melt(df1)
dfmelt

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

#### df.pivot( 'var', values='val')

In [187]:
dfmelt.pivot(columns='variable', values='value')

variable    a    b     c
0         4.0  NaN   NaN
1         5.0  NaN   NaN
2         6.0  NaN   NaN
3         NaN  7.0   NaN
4         NaN  8.0   NaN
5         NaN  9.0   NaN
6         NaN  NaN  10.0
7         NaN  NaN  11.0
8         NaN  NaN  12.0

#### pd.concate([df1,df2]) : 合併dataframe(row)

In [188]:
dfconcat = pd.concat([df1,df2])
dfconcat

    a   b   c
1   4   7  10
2   5   8  11
3   6   9  12
1   4   5   6
2   7   8   9
3  10  11  12

In [189]:
pd.concat([df1,df2],axis=1)

   a  b   c   a   b   c
1  4  7  10   4   5   6
2  5  8  11   7   8   9
3  6  9  12  10  11  12

### Sort

#### df.sort_values() : 依'a'進行排序

In [190]:
dfconcat.sort_values('a')

    a   b   c
1   4   7  10
1   4   5   6
2   5   8  11
3   6   9  12
2   7   8   9
3  10  11  12

#### df.sort_values() : 依'a'進行倒排序

In [191]:
dfconcat.sort_values('a',ascending=False)

    a   b   c
3  10  11  12
2   7   8   9
3   6   9  12
2   5   8  11
1   4   7  10
1   4   5   6

#### df.sort_index

In [192]:
dfconcat.sort_index()

    a   b   c
1   4   7  10
1   4   5   6
2   5   8  11
2   7   8   9
3   6   9  12
3  10  11  12

#### dfconcat.reset_index()

In [193]:
dfconcat.reset_index(drop=True)

    a   b   c
0   4   7  10
1   5   8  11
2   6   9  12
3   4   5   6
4   7   8   9
5  10  11  12

### Drop

#### df.drop( columns = [Length','Height]) : 去除欄位

In [194]:
dfconcat.drop(columns = ['a'])

    b   c
1   7  10
2   8  11
3   9  12
1   5   6
2   8   9
3  11  12

## DataFrame子搜尋(Row)

#### df[df.Length > 7] : 欄位邏輯判斷篩選(<,>,==,<=,>=,!=,)

In [195]:
dfconcat[dfconcat.a>3]

    a   b   c
1   4   7  10
2   5   8  11
3   6   9  12
1   4   5   6
2   7   8   9
3  10  11  12

#### 欄位含值判斷

In [196]:
dfconcat[dfconcat.a.isin([4])]

   a  b   c
1  4  7  10
1  4  5   6

#### df.drop_duplicates : 針對欄位去除相同值

In [197]:
dfconcat.drop_duplicates(['a'])

    a   b   c
1   4   7  10
2   5   8  11
3   6   9  12
2   7   8   9
3  10  11  12

#### pd.isnull :

In [198]:
dfconcat[pd.isnull(dfconcat.a)]

Empty DataFrame
Columns: [a, b, c]
Index: []

#### pd.notnull :

In [199]:
dfconcat[pd.notnull(dfconcat)]

    a   b   c
1   4   7  10
2   5   8  11
3   6   9  12
1   4   5   6
2   7   8   9
3  10  11  12

#### df.iloc : w透過Index索取值

In [200]:
dfconcat.iloc[1:3]

   a  b   c
2  5  8  11
3  6  9  12

In [201]:
df = pd.DataFrame({'col1': [True, True], 'col2': [True, False]})
df

   col1   col2
0  True   True
1  True  False

In [202]:
df.all()

col1     True
col2    False
dtype: bool

In [203]:
df.all(axis='columns')

0     True
1    False
dtype: bool

## DataFrame子搜尋(Col)

#### 搜索多欄位

In [204]:
dfconcat[['a','b']]

    a   b
1   4   7
2   5   8
3   6   9
1   4   5
2   7   8
3  10  11

#### 搜索單欄位

In [205]:
dfconcat['a']

1     4
2     5
3     6
1     4
2     7
3    10
Name: a, dtype: int64

#### 搜尋符合規則欄位

In [206]:
dfconcat.filter('\a')

Empty DataFrame
Columns: []
Index: [1, 2, 3, 1, 2, 3]

#### df.loc : 指定欄位的row搜索[logistic row ; 指定欄]

In [207]:
dfconcat.loc[dfconcat.a > 5 ,['b','c'] ]

    b   c
3   9  12
2   8   9
3  11  12

## 總結DataFrame

#### 計算指定欄位內容獨立重複出現次數

In [208]:
dfconcat.a.value_counts()

4     2
7     1
6     1
5     1
10    1
Name: a, dtype: int64

#### 計算指定欄位內容獨立類數

In [209]:
dfconcat.c.nunique()

5

#### 統籌基礎統計

In [210]:
dfconcat.describe()

               a      b          c
count   6.000000   6.00   6.000000
mean    6.000000   8.00  10.000000
std     2.280351   2.00   2.280351
min     4.000000   5.00   6.000000
25%     4.250000   7.25   9.250000
50%     5.500000   8.00  10.500000
75%     6.750000   8.75  11.750000
max    10.000000  11.00  12.000000

#### sum() : 總和 
#### count() : row計數
#### median() : 中位數
#### quantile([0.25,0.75]) : 百分位數
#### max() : 最大值
#### min() : 最小值
#### mean() : 平均值
#### var() : 變異數
#### std() : 標準差

In [211]:
dfconcat.quantile([0.25,0.75])

         a     b      c
0.25  4.25  7.25   9.25
0.75  6.75  8.75  11.75

#### 去除/填補缺值 df.dropna() / df.fillna(value)

In [212]:
df = pd.DataFrame(
        [[np.nan,5,6],
         [7,8,9],
         [10,11,12]],
    index = [1,2,3],
    columns=['a','b','c']
)

In [213]:
df

      a   b   c
1   NaN   5   6
2   7.0   8   9
3  10.0  11  12

In [214]:
df.dropna()

      a   b   c
2   7.0   8   9
3  10.0  11  12

In [215]:
df = df.fillna(100)

#### 經計算新增之欄位

In [216]:
df.assign(Area=lambda df : df.a*df.b)

       a   b   c   Area
1  100.0   5   6  500.0
2    7.0   8   9   56.0
3   10.0  11  12  110.0

In [217]:
df['Area'] = df.a*df.b
df

       a   b   c   Area
1  100.0   5   6  500.0
2    7.0   8   9   56.0
3   10.0  11  12  110.0

#### 拆切 pd.cut()

In [218]:
df = pd.DataFrame({'Ages': ages})
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32, 101]
bins = [18, 25, 35, 60, 100]
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

df['asdf'] = pd.Series(pd.cut(ages, bins, labels=group_names))
df

    Ages        asdf
0     20       Youth
1     22       Youth
2     25       Youth
3     27  YoungAdult
4     21       Youth
5     23       Youth
6     37  MiddleAged
7     31  YoungAdult
8     61      Senior
9     45  MiddleAged
10    41  MiddleAged
11    20  YoungAdult
12   101         NaN

#### 百分位拆切 pd.qcut()

In [219]:
data = np.random.randn(1000) #高斯分佈
cats = pd.qcut(data, 2) #按四分位數分類，也可以用[0, .25, .5, .75, 1.]
pd.DataFrame(cats)

                    0
0     (0.0139, 2.677]
1    (-3.379, 0.0139]
2    (-3.379, 0.0139]
3    (-3.379, 0.0139]
4    (-3.379, 0.0139]
..                ...
995  (-3.379, 0.0139]
996   (0.0139, 2.677]
997  (-3.379, 0.0139]
998  (-3.379, 0.0139]
999   (0.0139, 2.677]

[1000 rows x 1 columns]

#### 閾值分割

In [220]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32, 101]
weight = [80, 72, 75, 77, 71, 73, 77, 81, 81, 85,81, 72, 77]
df = pd.DataFrame({'Ages': ages,'weight' : weight})
df.clip(lower=-10,upper=100)

    Ages  weight
0     20      80
1     22      72
2     25      75
3     27      77
4     21      71
5     23      73
6     37      77
7     31      81
8     61      81
9     45      85
10    41      81
11    32      72
12   100      77

#### 群據統計

#### 針對某欄群聚進行他欄函式統計結果

In [221]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 20, 101]
weight = [80, 72, 75, 77, 71, 73, 77, 81, 81, 85,81, 72, 77]
df = pd.DataFrame({'Ages': ages,'weight' : weight})
df.groupby(by='Ages').max()

      weight
Ages
20        80
21        71
22        72
23        73
25        75
27        77
31        81
37        77
41        81
45        85
61        81
101       77

In [222]:
df.groupby('Ages').agg(['min', 'max'])

     weight
        min max
Ages
20       72  80
21       71  71
22       72  72
23       73  73
25       75  75
27       77  77
31       81  81
37       77  77
41       81  81
45       85  85
61       81  81
101      77  77

#### 向下搬動?格

In [223]:
df.shift(1)

    Ages  weight
0    NaN     NaN
1   20.0    80.0
2   22.0    72.0
3   25.0    75.0
4   27.0    77.0
5   21.0    71.0
6   23.0    73.0
7   37.0    77.0
8   31.0    81.0
9   61.0    81.0
10  45.0    85.0
11  41.0    81.0
12  20.0    72.0

#### 累計總和

In [224]:
df.cumsum()

    Ages  weight
0     20      80
1     42     152
2     67     227
3     94     304
4    115     375
5    138     448
6    175     525
7    206     606
8    267     687
9    312     772
10   353     853
11   373     925
12   474    1002

#### 累計最大/最小值

In [225]:
df.cummin()

    Ages  weight
0     20      80
1     20      72
2     20      72
3     20      72
4     20      71
5     20      71
6     20      71
7     20      71
8     20      71
9     20      71
10    20      71
11    20      71
12    20      71

#### 累計加乘

In [226]:
df.cumprod()

                  Ages               weight
0                   20                   80
1                  440                 5760
2                11000               432000
3               297000             33264000
4              6237000           2361744000
5            143451000         172407312000
6           5307687000       13275363024000
7         164538297000     1075304404944000
8       10036836117000    87099656800464000
9      451657625265000  7403470828039440000
10   18517962635865000 -9061417361220563328
11  370359252717300000 -6786007428046253056
12  512796377028196768 -6013737895694040064

## 結合資料set

In [231]:
adf = pd.DataFrame({'x1' : ['A','B','C'],'x2' : [1,2,3]})
bdf = pd.DataFrame({'x1' : ['A','B','D'],'x2' : [True,False,True]})
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [229]:
bdf

  x1     x2
0  A   True
1  B  False
2  D   True

#### pd.merge ->left : 以左set為主 on ->指定欄位

In [230]:
pd.merge(adf,bdf,how='left',on='x1')

  x1  x2_x   x2_y
0  A     1   True
1  B     2  False
2  C     3    NaN

#### pd.merge ->left : 以右set為主 on ->指定欄位

In [234]:
pd.merge(adf,bdf,how='right',on='x1')

  x1  x2_x   x2_y
0  A   1.0   True
1  B   2.0  False
2  D   NaN   True

#### pd.merge ->inner : 以兩set皆有為主 on ->指定欄位

In [236]:
pd.merge(adf,bdf,how='inner',on='x1')

  x1  x2_x   x2_y
0  A     1   True
1  B     2  False

#### pd.merge ->outer : 參考所有值 on ->指定欄位

In [237]:
pd.merge(adf,bdf,how='outer',on='x1')

  x1  x2_x   x2_y
0  A   1.0   True
1  B   2.0  False
2  C   3.0    NaN
3  D   NaN   True